Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_application_cti.h
/*
 * SPDX-License-Identifier: MIT
 * SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
 *
 * Generated using the .svd description
 * Goal:     nrf5340_application_cti equates.
 */

#pragma once

#include    <stdint.h>

// CTI address definitions
// -----------------------

typedef struct {
    volatile    uint32_t    CTICONTROL;
    volatile    uint32_t    RESERVED0[3];
    volatile    uint32_t    CTIINTACK;
    volatile    uint32_t    CTIAPPSET;
    volatile    uint32_t    CTIAPPCLEAR;
    volatile    uint32_t    CTIAPPPULSE;
    volatile    uint32_t    CTIINEN[8];
    volatile    uint32_t    RESERVED1[24];
    volatile    uint32_t    CTIOUTEN[8];
    volatile    uint32_t    RESERVED2[28];
    volatile    uint32_t    CTITRIGINSTATUS;
    volatile    uint32_t    CTITRIGOUTSTATUS;
    volatile    uint32_t    CTICHINSTATUS;
    volatile    uint32_t    RESERVED3;
    volatile    uint32_t    CTIGATE;
    volatile    uint32_t    RESERVED4[926];
    volatile    uint32_t    DEVARCH;
    volatile    uint32_t    RESERVED5[2];
    volatile    uint32_t    DEVID;
    volatile    uint32_t    DEVTYPE;
    volatile    uint32_t    PIDR4;
    volatile    uint32_t    PIDR5;
    volatile    uint32_t    PIDR6;
    volatile    uint32_t    PIDR7;
    volatile    uint32_t    PIDR0;
    volatile    uint32_t    PIDR1;
    volatile    uint32_t    PIDR2;
    volatile    uint32_t    PIDR3;
    volatile    uint32_t    CIDR0;
    volatile    uint32_t    CIDR1;
    volatile    uint32_t    CIDR2;
    volatile    uint32_t    CIDR3;
} CTI_TypeDef;

#ifdef __cplusplus
#define CTI_S   reinterpret_cast<CTI_TypeDef *>(0xE0042000U)

#else
#define CTI_S   ((CTI_TypeDef *)0xE0042000U)
#endif

// CTICONTROL Configuration

#define CTI_CTICONTROL_GLBEN                        (0x1U<<0)
#define CTI_CTICONTROL_GLBEN_DISABLED               (0x0U<<0)
#define CTI_CTICONTROL_GLBEN_ENABLED                (0x1U<<0)

// CTIINTACK Configuration

#define CTI_CTIINTACK_ETMEVTIN3                     (0x1U<<7)
#define CTI_CTIINTACK_ETMEVTIN2                     (0x1U<<6)
#define CTI_CTIINTACK_ETMEVTIN1                     (0x1U<<5)
#define CTI_CTIINTACK_ETMEVTIN0                     (0x1U<<4)
#define CTI_CTIINTACK_UNUSED1                       (0x1U<<3)
#define CTI_CTIINTACK_UNUSED0                       (0x1U<<2)
#define CTI_CTIINTACK_CPURESTART                    (0x1U<<1)
#define CTI_CTIINTACK_DEBUGREQ                      (0x1U<<0)
#define CTI_CTIINTACK_ETMEVTIN3_ACKNOWLEDGE         (0x1U<<7)
#define CTI_CTIINTACK_ETMEVTIN2_ACKNOWLEDGE         (0x1U<<6)
#define CTI_CTIINTACK_ETMEVTIN1_ACKNOWLEDGE         (0x1U<<5)
#define CTI_CTIINTACK_ETMEVTIN0_ACKNOWLEDGE         (0x1U<<4)
#define CTI_CTIINTACK_UNUSED1_ACKNOWLEDGE           (0x1U<<3)
#define CTI_CTIINTACK_UNUSED0_ACKNOWLEDGE           (0x1U<<2)
#define CTI_CTIINTACK_CPURESTART_ACKNOWLEDGE        (0x1U<<1)
#define CTI_CTIINTACK_DEBUGREQ_ACKNOWLEDGE          (0x1U<<0)

// CTIAPPSET Configuration

#define CTI_CTIAPPSET_APPSET_3                      (0x1U<<3)
#define CTI_CTIAPPSET_APPSET_2                      (0x1U<<2)
#define CTI_CTIAPPSET_APPSET_1                      (0x1U<<1)
#define CTI_CTIAPPSET_APPSET_0                      (0x1U<<0)
#define CTI_CTIAPPSET_APPSET_3_INACTIVE             (0x0U<<3)
#define CTI_CTIAPPSET_APPSET_3_ACTIVE               (0x1U<<3)
#define CTI_CTIAPPSET_APPSET_3_ACTIVATE             (0x1U<<3)
#define CTI_CTIAPPSET_APPSET_2_INACTIVE             (0x0U<<2)
#define CTI_CTIAPPSET_APPSET_2_ACTIVE               (0x1U<<2)
#define CTI_CTIAPPSET_APPSET_2_ACTIVATE             (0x1U<<2)
#define CTI_CTIAPPSET_APPSET_1_INACTIVE             (0x0U<<1)
#define CTI_CTIAPPSET_APPSET_1_ACTIVE               (0x1U<<1)
#define CTI_CTIAPPSET_APPSET_1_ACTIVATE             (0x1U<<1)
#define CTI_CTIAPPSET_APPSET_0_INACTIVE             (0x0U<<0)
#define CTI_CTIAPPSET_APPSET_0_ACTIVE               (0x1U<<0)
#define CTI_CTIAPPSET_APPSET_0_ACTIVATE             (0x1U<<0)

// CTIAPPCLEAR Configuration

#define CTI_CTIAPPCLEAR_APPCLEAR_3                  (0x1U<<3)
#define CTI_CTIAPPCLEAR_APPCLEAR_2                  (0x1U<<2)
#define CTI_CTIAPPCLEAR_APPCLEAR_1                  (0x1U<<1)
#define CTI_CTIAPPCLEAR_APPCLEAR_0                  (0x1U<<0)
#define CTI_CTIAPPCLEAR_APPCLEAR_3_CLEAR            (0x1U<<3)
#define CTI_CTIAPPCLEAR_APPCLEAR_2_CLEAR            (0x1U<<2)
#define CTI_CTIAPPCLEAR_APPCLEAR_1_CLEAR            (0x1U<<1)
#define CTI_CTIAPPCLEAR_APPCLEAR_0_CLEAR            (0x1U<<0)

// CTIAPPPULSE Configuration

#define CTI_CTIAPPPULSE_APPULSE_3                   (0x1U<<3)
#define CTI_CTIAPPPULSE_APPULSE_2                   (0x1U<<2)
#define CTI_CTIAPPPULSE_APPULSE_1                   (0x1U<<1)
#define CTI_CTIAPPPULSE_APPULSE_0                   (0x1U<<0)
#define CTI_CTIAPPPULSE_APPULSE_3_GENERATE          (0x1U<<3)
#define CTI_CTIAPPPULSE_APPULSE_2_GENERATE          (0x1U<<2)
#define CTI_CTIAPPPULSE_APPULSE_1_GENERATE          (0x1U<<1)
#define CTI_CTIAPPPULSE_APPULSE_0_GENERATE          (0x1U<<0)

// CTIINEN Configuration

#define CTI_CTIINEN_TRIGINEN_3                      (0x1U<<3)
#define CTI_CTIINEN_TRIGINEN_2                      (0x1U<<2)
#define CTI_CTIINEN_TRIGINEN_1                      (0x1U<<1)
#define CTI_CTIINEN_TRIGINEN_0                      (0x1U<<0)
#define CTI_CTIINEN_TRIGINEN_3_DISABLED             (0x0U<<3)
#define CTI_CTIINEN_TRIGINEN_3_ENABLED              (0x1U<<3)
#define CTI_CTIINEN_TRIGINEN_2_DISABLED             (0x0U<<2)
#define CTI_CTIINEN_TRIGINEN_2_ENABLED              (0x1U<<2)
#define CTI_CTIINEN_TRIGINEN_1_DISABLED             (0x0U<<1)
#define CTI_CTIINEN_TRIGINEN_1_ENABLED              (0x1U<<1)
#define CTI_CTIINEN_TRIGINEN_0_DISABLED             (0x0U<<0)
#define CTI_CTIINEN_TRIGINEN_0_ENABLED              (0x1U<<0)

// CTIOUTEN Configuration

#define CTI_CTIOUTEN_TRIGOUTEN_3                    (0x1U<<3)
#define CTI_CTIOUTEN_TRIGOUTEN_2                    (0x1U<<2)
#define CTI_CTIOUTEN_TRIGOUTEN_1                    (0x1U<<1)
#define CTI_CTIOUTEN_TRIGOUTEN_0                    (0x1U<<0)
#define CTI_CTIOUTEN_TRIGOUTEN_3_DISABLED           (0x0U<<3)
#define CTI_CTIOUTEN_TRIGOUTEN_3_ENABLED            (0x1U<<3)
#define CTI_CTIOUTEN_TRIGOUTEN_2_DISABLED           (0x0U<<2)
#define CTI_CTIOUTEN_TRIGOUTEN_2_ENABLED            (0x1U<<2)
#define CTI_CTIOUTEN_TRIGOUTEN_1_DISABLED           (0x0U<<1)
#define CTI_CTIOUTEN_TRIGOUTEN_1_ENABLED            (0x1U<<1)
#define CTI_CTIOUTEN_TRIGOUTEN_0_DISABLED           (0x0U<<0)
#define CTI_CTIOUTEN_TRIGOUTEN_0_ENABLED            (0x1U<<0)

// CTITRIGINSTATUS Configuration

#define CTI_CTITRIGINSTATUS_UNUSED1                 (0x1U<<7)
#define CTI_CTITRIGINSTATUS_UNUSED0                 (0x1U<<6)
#define CTI_CTITRIGINSTATUS_ETMEVTOUT1              (0x1U<<5)
#define CTI_CTITRIGINSTATUS_ETMEVTOUT0              (0x1U<<4)
#define CTI_CTITRIGINSTATUS_DWTCOMPOUT2             (0x1U<<3)
#define CTI_CTITRIGINSTATUS_DWTCOMPOUT1             (0x1U<<2)
#define CTI_CTITRIGINSTATUS_DWTCOMPOUT0             (0x1U<<1)
#define CTI_CTITRIGINSTATUS_CPUHALTED               (0x1U<<0)
#define CTI_CTITRIGINSTATUS_UNUSED1_ACTIVE          (0x1U<<7)
#define CTI_CTITRIGINSTATUS_UNUSED1_INACTIVE        (0x0U<<7)
#define CTI_CTITRIGINSTATUS_UNUSED0_ACTIVE          (0x1U<<6)
#define CTI_CTITRIGINSTATUS_UNUSED0_INACTIVE        (0x0U<<6)
#define CTI_CTITRIGINSTATUS_ETMEVTOUT1_ACTIVE       (0x1U<<5)
#define CTI_CTITRIGINSTATUS_ETMEVTOUT1_INACTIVE     (0x0U<<5)
#define CTI_CTITRIGINSTATUS_ETMEVTOUT0_ACTIVE       (0x1U<<4)
#define CTI_CTITRIGINSTATUS_ETMEVTOUT0_INACTIVE     (0x0U<<4)
#define CTI_CTITRIGINSTATUS_DWTCOMPOUT2_ACTIVE      (0x1U<<3)
#define CTI_CTITRIGINSTATUS_DWTCOMPOUT2_INACTIVE    (0x0U<<3)
#define CTI_CTITRIGINSTATUS_DWTCOMPOUT1_ACTIVE      (0x1U<<2)
#define CTI_CTITRIGINSTATUS_DWTCOMPOUT1_INACTIVE    (0x0U<<2)
#define CTI_CTITRIGINSTATUS_DWTCOMPOUT0_ACTIVE      (0x1U<<1)
#define CTI_CTITRIGINSTATUS_DWTCOMPOUT0_INACTIVE    (0x0U<<1)
#define CTI_CTITRIGINSTATUS_CPUHALTED_ACTIVE        (0x1U<<0)
#define CTI_CTITRIGINSTATUS_CPUHALTED_INACTIVE      (0x0U<<0)

// CTITRIGOUTSTATUS Configuration

#define CTI_CTITRIGOUTSTATUS_ETMEVTIN3              (0x1U<<7)
#define CTI_CTITRIGOUTSTATUS_ETMEVTIN2              (0x1U<<6)
#define CTI_CTITRIGOUTSTATUS_ETMEVTIN1              (0x1U<<5)
#define CTI_CTITRIGOUTSTATUS_ETMEVTIN0              (0x1U<<4)
#define CTI_CTITRIGOUTSTATUS_UNUSED1                (0x1U<<3)
#define CTI_CTITRIGOUTSTATUS_UNUSED0                (0x1U<<2)
#define CTI_CTITRIGOUTSTATUS_CPURESTART             (0x1U<<1)
#define CTI_CTITRIGOUTSTATUS_DEBUGREQ               (0x1U<<0)
#define CTI_CTITRIGOUTSTATUS_ETMEVTIN3_ACTIVE       (0x1U<<7)
#define CTI_CTITRIGOUTSTATUS_ETMEVTIN3_INACTIVE     (0x0U<<7)
#define CTI_CTITRIGOUTSTATUS_ETMEVTIN2_ACTIVE       (0x1U<<6)
#define CTI_CTITRIGOUTSTATUS_ETMEVTIN2_INACTIVE     (0x0U<<6)
#define CTI_CTITRIGOUTSTATUS_ETMEVTIN1_ACTIVE       (0x1U<<5)
#define CTI_CTITRIGOUTSTATUS_ETMEVTIN1_INACTIVE     (0x0U<<5)
#define CTI_CTITRIGOUTSTATUS_ETMEVTIN0_ACTIVE       (0x1U<<4)
#define CTI_CTITRIGOUTSTATUS_ETMEVTIN0_INACTIVE     (0x0U<<4)
#define CTI_CTITRIGOUTSTATUS_UNUSED1_ACTIVE         (0x1U<<3)
#define CTI_CTITRIGOUTSTATUS_UNUSED1_INACTIVE       (0x0U<<3)
#define CTI_CTITRIGOUTSTATUS_UNUSED0_ACTIVE         (0x1U<<2)
#define CTI_CTITRIGOUTSTATUS_UNUSED0_INACTIVE       (0x0U<<2)
#define CTI_CTITRIGOUTSTATUS_CPURESTART_ACTIVE      (0x1U<<1)
#define CTI_CTITRIGOUTSTATUS_CPURESTART_INACTIVE    (0x0U<<1)
#define CTI_CTITRIGOUTSTATUS_DEBUGREQ_ACTIVE        (0x1U<<0)
#define CTI_CTITRIGOUTSTATUS_DEBUGREQ_INACTIVE      (0x0U<<0)

// CTICHINSTATUS Configuration

#define CTI_CTICHINSTATUS_CTICHINSTATUS_3           (0x1U<<3)
#define CTI_CTICHINSTATUS_CTICHINSTATUS_2           (0x1U<<2)
#define CTI_CTICHINSTATUS_CTICHINSTATUS_1           (0x1U<<1)
#define CTI_CTICHINSTATUS_CTICHINSTATUS_0           (0x1U<<0)
#define CTI_CTICHINSTATUS_CTICHINSTATUS_3_ACTIVE    (0x1U<<3)
#define CTI_CTICHINSTATUS_CTICHINSTATUS_3_INACTIVE  (0x0U<<3)
#define CTI_CTICHINSTATUS_CTICHINSTATUS_2_ACTIVE    (0x1U<<2)
#define CTI_CTICHINSTATUS_CTICHINSTATUS_2_INACTIVE  (0x0U<<2)
#define CTI_CTICHINSTATUS_CTICHINSTATUS_1_ACTIVE    (0x1U<<1)
#define CTI_CTICHINSTATUS_CTICHINSTATUS_1_INACTIVE  (0x0U<<1)
#define CTI_CTICHINSTATUS_CTICHINSTATUS_0_ACTIVE    (0x1U<<0)
#define CTI_CTICHINSTATUS_CTICHINSTATUS_0_INACTIVE  (0x0U<<0)

// CTIGATE Configuration

#define CTI_CTIGATE_CTIGATEEN_3                     (0x1U<<3)
#define CTI_CTIGATE_CTIGATEEN_2                     (0x1U<<2)
#define CTI_CTIGATE_CTIGATEEN_1                     (0x1U<<1)
#define CTI_CTIGATE_CTIGATEEN_0                     (0x1U<<0)
#define CTI_CTIGATE_CTIGATEEN_3_ENABLED             (0x1U<<3)
#define CTI_CTIGATE_CTIGATEEN_3_DISABLED            (0x0U<<3)
#define CTI_CTIGATE_CTIGATEEN_2_ENABLED             (0x1U<<2)
#define CTI_CTIGATE_CTIGATEEN_2_DISABLED            (0x0U<<2)
#define CTI_CTIGATE_CTIGATEEN_1_ENABLED             (0x1U<<1)
#define CTI_CTIGATE_CTIGATEEN_1_DISABLED            (0x0U<<1)
#define CTI_CTIGATE_CTIGATEEN_0_ENABLED             (0x1U<<0)
#define CTI_CTIGATE_CTIGATEEN_0_DISABLED            (0x0U<<0)

// DEVARCH Configuration

#define CTI_DEVARCH_ARCHITECTURE                    (0x1U<<0)

// DEVID Configuration

#define CTI_DEVID_NUMCH                             (0xFU<<16)
#define CTI_DEVID_NUMCH_0                           (0x1U<<16)
#define CTI_DEVID_NUMTRIG                           (0xFFU<<8)
#define CTI_DEVID_NUMTRIG_0                         (0x1U<<8)
#define CTI_DEVID_EXTMUXNUM                         (0x1FU<<0)
#define CTI_DEVID_EXTMUXNUM_0                       (0x1U<<0)

// DEVTYPE Configuration

#define CTI_DEVTYPE_SUB                             (0xFU<<4)
#define CTI_DEVTYPE_SUB_0                           (0x1U<<4)
#define CTI_DEVTYPE_MAJOR                           (0xFU<<0)
#define CTI_DEVTYPE_MAJOR_0                         (0x1U<<0)
#define CTI_DEVTYPE_SUB_CROSSTRIGGER                (0x1U<<4)
#define CTI_DEVTYPE_MAJOR_CONTROLLER                (0x4U<<0)

// PIDR4 Configuration

#define CTI_PIDR4_SIZE                              (0xFU<<4)
#define CTI_PIDR4_SIZE_0                            (0x1U<<4)
#define CTI_PIDR4_DES_2                             (0xFU<<0)
#define CTI_PIDR4_DES_2_0                           (0x1U<<0)
#define CTI_PIDR4_DES_2_CODE                        (0x4U<<0)

// PIDR0 Configuration

#define CTI_PIDR0_PART_0                            (0xFFU<<0)
#define CTI_PIDR0_PART_0_0                          (0x1U<<0)
#define CTI_PIDR0_PART_0_PARTNUMBERL                (0x21U<<0)

// PIDR1 Configuration

#define CTI_PIDR1_DES_0                             (0xFU<<4)
#define CTI_PIDR1_DES_0_0                           (0x1U<<4)
#define CTI_PIDR1_PART_1                            (0xFU<<0)
#define CTI_PIDR1_PART_1_0                          (0x1U<<0)
#define CTI_PIDR1_DES_0_ARM                         (0xBU<<4)
#define CTI_PIDR1_PART_1_PARTNUMBERH                (0xDU<<0)

// PIDR2 Configuration

#define CTI_PIDR2_REVISION                          (0xFU<<4)
#define CTI_PIDR2_REVISION_0                        (0x1U<<4)
#define CTI_PIDR2_JEDEC                             (0x1U<<3)
#define CTI_PIDR2_DES_1                             (0x7U<<0)
#define CTI_PIDR2_DES_1_0                           (0x1U<<0)
#define CTI_PIDR2_REVISION_REV0P0                   (0x0U<<4)
#define CTI_PIDR2_DES_1_ARM                         (0x3U<<0)

// PIDR3 Configuration

#define CTI_PIDR3_REVAND                            (0xFU<<4)
#define CTI_PIDR3_REVAND_0                          (0x1U<<4)
#define CTI_PIDR3_CMOD                              (0xFU<<0)
#define CTI_PIDR3_CMOD_0                            (0x1U<<0)
#define CTI_PIDR3_REVAND_NOERRATA                   (0x0U<<4)
#define CTI_PIDR3_CMOD_UNMODIFIED                   (0x0U<<0)

// CIDR0 Configuration

#define CTI_CIDR0_PRMBL_0                           (0xFFU<<0)
#define CTI_CIDR0_PRMBL_0_0                         (0x1U<<0)
#define CTI_CIDR0_PRMBL_0_VALUE                     (0xDU<<0)

// CIDR1 Configuration

#define CTI_CIDR1_CLASS                             (0xFU<<4)
#define CTI_CIDR1_CLASS_0                           (0x1U<<4)
#define CTI_CIDR1_PRMBL_1                           (0xFU<<0)
#define CTI_CIDR1_PRMBL_1_0                         (0x1U<<0)
#define CTI_CIDR1_CLASS_CORESIGHT                   (0x9U<<4)
#define CTI_CIDR1_PRMBL_1_VALUE                     (0x0U<<0)

// CIDR2 Configuration

#define CTI_CIDR2_PRMBL_2                           (0xFFU<<0)
#define CTI_CIDR2_PRMBL_2_0                         (0x1U<<0)
#define CTI_CIDR2_PRMBL_2_VALUE                     (0x5U<<0)

// CIDR3 Configuration

#define CTI_CIDR3_PRMBL_3                           (0xFFU<<0)
#define CTI_CIDR3_PRMBL_3_0                         (0x1U<<0)
#define CTI_CIDR3_PRMBL_3_VALUE                     (0xB1U<<0)
